anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/boot_rom/f28002x/rev0/rom_sources/F28002x_ROM/inc/hw_outputxbar.h
//###########################################################################
//
// FILE:    hw_outputxbar.h
//
// TITLE:   Definitions for the XBAR registers.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:  $
//###########################################################################

#ifndef HW_OUTPUTXBAR_H
#define HW_OUTPUTXBAR_H

//*****************************************************************************
//
// The following are defines for the XBAR register offsets
//
//*****************************************************************************
#define XBAR_O_OUTPUT1MUX0TO15CFG  0x0U         // Output X-BAR Mux
                                               // Configuration for Output 1
#define XBAR_O_OUTPUT1MUX16TO31CFG  0x2U         // Output X-BAR Mux
                                               // Configuration for Output 1
#define XBAR_O_OUTPUT2MUX0TO15CFG  0x4U         // Output X-BAR Mux
                                               // Configuration for Output 2
#define XBAR_O_OUTPUT2MUX16TO31CFG  0x6U         // Output X-BAR Mux
                                               // Configuration for Output 2
#define XBAR_O_OUTPUT3MUX0TO15CFG  0x8U         // Output X-BAR Mux
                                               // Configuration for Output 3
#define XBAR_O_OUTPUT3MUX16TO31CFG  0xAU         // Output X-BAR Mux
                                               // Configuration for Output 3
#define XBAR_O_OUTPUT4MUX0TO15CFG  0xCU         // Output X-BAR Mux
                                               // Configuration for Output 4
#define XBAR_O_OUTPUT4MUX16TO31CFG  0xEU         // Output X-BAR Mux
                                               // Configuration for Output 4
#define XBAR_O_OUTPUT5MUX0TO15CFG  0x10U        // Output X-BAR Mux
                                               // Configuration for Output 5
#define XBAR_O_OUTPUT5MUX16TO31CFG  0x12U        // Output X-BAR Mux
                                               // Configuration for Output 5
#define XBAR_O_OUTPUT6MUX0TO15CFG  0x14U        // Output X-BAR Mux
                                               // Configuration for Output 6
#define XBAR_O_OUTPUT6MUX16TO31CFG  0x16U        // Output X-BAR Mux
                                               // Configuration for Output 6
#define XBAR_O_OUTPUT7MUX0TO15CFG  0x18U        // Output X-BAR Mux
                                               // Configuration for Output 7
#define XBAR_O_OUTPUT7MUX16TO31CFG  0x1AU        // Output X-BAR Mux
                                               // Configuration for Output 7
#define XBAR_O_OUTPUT8MUX0TO15CFG  0x1CU        // Output X-BAR Mux
                                               // Configuration for Output 8
#define XBAR_O_OUTPUT8MUX16TO31CFG  0x1EU        // Output X-BAR Mux
                                               // Configuration for Output 8
#define XBAR_O_OUTPUT1MUXENABLE   0x20U        // Output X-BAR Mux Enable  for
                                               // Output 1
#define XBAR_O_OUTPUT2MUXENABLE   0x22U        // Output X-BAR Mux Enable  for
                                               // Output 2
#define XBAR_O_OUTPUT3MUXENABLE   0x24U        // Output X-BAR Mux Enable  for
                                               // Output 3
#define XBAR_O_OUTPUT4MUXENABLE   0x26U        // Output X-BAR Mux Enable  for
                                               // Output 4
#define XBAR_O_OUTPUT5MUXENABLE   0x28U        // Output X-BAR Mux Enable  for
                                               // Output 5
#define XBAR_O_OUTPUT6MUXENABLE   0x2AU        // Output X-BAR Mux Enable  for
                                               // Output 6
#define XBAR_O_OUTPUT7MUXENABLE   0x2CU        // Output X-BAR Mux Enable  for
                                               // Output 7
#define XBAR_O_OUTPUT8MUXENABLE   0x2EU        // Output X-BAR Mux Enable  for
                                               // Output 8
#define XBAR_O_OUTPUTLATCH        0x30U        // Output X-BAR Output Latch
#define XBAR_O_OUTPUTLATCHCLR     0x32U        // Output X-BAR Output Latch
                                               // Clear
#define XBAR_O_OUTPUTLATCHFRC     0x34U        // Output X-BAR Output Latch
                                               // Clear
#define XBAR_O_OUTPUTLATCHENABLE  0x36U        // Output X-BAR Output Latch
                                               // Enable
#define XBAR_O_OUTPUTINV          0x38U        // Output X-BAR Output Inversion
#define XBAR_O_OUTPUTLOCK         0x3EU        // Output X-BAR Configuration
                                               // Lock register

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT1MUX0TO15CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT1MUX0TO15CFG_MUX0_S  0U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX0_M  0x3U         // Mux0 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX1_S  2U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX1_M  0xCU         // Mux1 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX2_S  4U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX2_M  0x30U        // Mux2 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX3_S  6U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX3_M  0xC0U        // Mux3 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX4_S  8U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX4_M  0x300U       // Mux4 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX5_S  10U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX5_M  0xC00U       // Mux5 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX6_S  12U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX6_M  0x3000U      // Mux6 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX7_S  14U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX7_M  0xC000U      // Mux7 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX8_S  16U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX8_M  0x30000U     // Mux8 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX9_S  18U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX9_M  0xC0000U     // Mux9 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX10_S  20U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX10_M  0x300000U    // Mux10 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX11_S  22U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX11_M  0xC00000U    // Mux11 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX12_S  24U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX12_M  0x3000000U   // Mux12 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX13_S  26U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX13_M  0xC000000U   // Mux13 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX14_S  28U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX14_M  0x30000000U  // Mux14 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX0TO15CFG_MUX15_S  30U
#define XBAR_OUTPUT1MUX0TO15CFG_MUX15_M  0xC0000000U  // Mux15 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT1MUX16TO31CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT1MUX16TO31CFG_MUX16_S  0U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX16_M  0x3U         // Mux16 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX17_S  2U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX17_M  0xCU         // Mux17 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX18_S  4U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX18_M  0x30U        // Mux18 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX19_S  6U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX19_M  0xC0U        // Mux19 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX20_S  8U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX20_M  0x300U       // Mux20 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX21_S  10U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX21_M  0xC00U       // Mux21 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX22_S  12U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX22_M  0x3000U      // Mux22 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX23_S  14U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX23_M  0xC000U      // Mux23 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX24_S  16U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX24_M  0x30000U     // Mux24 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX25_S  18U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX25_M  0xC0000U     // Mux25 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX26_S  20U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX26_M  0x300000U    // Mux26 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX27_S  22U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX27_M  0xC00000U    // Mux27 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX28_S  24U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX28_M  0x3000000U   // Mux28 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX29_S  26U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX29_M  0xC000000U   // Mux29 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX30_S  28U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX30_M  0x30000000U  // Mux30 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR
#define XBAR_OUTPUT1MUX16TO31CFG_MUX31_S  30U
#define XBAR_OUTPUT1MUX16TO31CFG_MUX31_M  0xC0000000U  // Mux31 Configuration for
                                               // OUTPUT1 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT2MUX0TO15CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT2MUX0TO15CFG_MUX0_S  0U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX0_M  0x3U         // Mux0 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX1_S  2U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX1_M  0xCU         // Mux1 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX2_S  4U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX2_M  0x30U        // Mux2 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX3_S  6U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX3_M  0xC0U        // Mux3 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX4_S  8U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX4_M  0x300U       // Mux4 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX5_S  10U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX5_M  0xC00U       // Mux5 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX6_S  12U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX6_M  0x3000U      // Mux6 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX7_S  14U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX7_M  0xC000U      // Mux7 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX8_S  16U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX8_M  0x30000U     // Mux8 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX9_S  18U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX9_M  0xC0000U     // Mux9 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX10_S  20U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX10_M  0x300000U    // Mux10 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX11_S  22U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX11_M  0xC00000U    // Mux11 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX12_S  24U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX12_M  0x3000000U   // Mux12 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX13_S  26U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX13_M  0xC000000U   // Mux13 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX14_S  28U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX14_M  0x30000000U  // Mux14 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX0TO15CFG_MUX15_S  30U
#define XBAR_OUTPUT2MUX0TO15CFG_MUX15_M  0xC0000000U  // Mux15 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT2MUX16TO31CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT2MUX16TO31CFG_MUX16_S  0U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX16_M  0x3U         // Mux16 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX17_S  2U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX17_M  0xCU         // Mux17 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX18_S  4U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX18_M  0x30U        // Mux18 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX19_S  6U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX19_M  0xC0U        // Mux19 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX20_S  8U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX20_M  0x300U       // Mux20 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX21_S  10U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX21_M  0xC00U       // Mux21 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX22_S  12U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX22_M  0x3000U      // Mux22 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX23_S  14U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX23_M  0xC000U      // Mux23 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX24_S  16U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX24_M  0x30000U     // Mux24 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX25_S  18U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX25_M  0xC0000U     // Mux25 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX26_S  20U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX26_M  0x300000U    // Mux26 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX27_S  22U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX27_M  0xC00000U    // Mux27 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX28_S  24U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX28_M  0x3000000U   // Mux28 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX29_S  26U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX29_M  0xC000000U   // Mux29 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX30_S  28U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX30_M  0x30000000U  // Mux30 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR
#define XBAR_OUTPUT2MUX16TO31CFG_MUX31_S  30U
#define XBAR_OUTPUT2MUX16TO31CFG_MUX31_M  0xC0000000U  // Mux31 Configuration for
                                               // OUTPUT2 of OUTPUT-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the OUTPUT3MUX0TO15CFG register
//
//*****************************************************************************
#define XBAR_OUTPUT3MUX0TO15CFG_MUX0_S  0U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX0_M  0x3U         // Mux0 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX1_S  2U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX1_M  0xCU         // Mux1 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX2_S  4U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX2_M  0x30U        // Mux2 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX3_S  6U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX3_M  0xC0U        // Mux3 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX4_S  8U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX4_M  0x300U       // Mux4 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX5_S  10U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX5_M  0xC00U       // Mux5 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX6_S  12U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX6_M  0x3000U      // Mux6 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX7_S  14U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX7_M  0xC000U      // Mux7 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX8_S  16U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX8_M  0x30000U     // Mux8 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX9_S  18U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX9_M  0xC0000U     // Mux9 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX10_S  20U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX10_M  0x300000U    // Mux10 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX11_S  22U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX11_M  0xC00000U    // Mux11 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX12_S  24U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX12_M  0x3000000U   // Mux12 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX13_S  26U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX13_M  0xC000000U   // Mux13 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX14_S  28U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX14_M  0x30000000U  // Mux14 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR
#define XBAR_OUTPUT3MUX0TO15CFG_MUX15_S  30U
#define XBAR_OUTPUT3MUX0TO15CFG_MUX15_M  0xC0000000U  // Mux15 Configuration for
                                               // OUTPUT3 of OUTPUT-XBAR

